## Importing necessary libraries

In [1]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm

In [2]:
labtat_data = pd.read_csv('LabTAT.csv')    # Importing dataset
labtat_data

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [8]:
labtat_data.head(10)

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60
5        179.45        197.00        181.51        161.12
6        191.37        166.36        214.21        154.02
7        166.81        169.60        183.43        163.25
8        158.81        175.36        191.60        152.79
9        165.88        198.68        208.43        161.98

In [3]:
labtat_data.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

### Anova f-test statistics: Used for Analysis of Variance between more than 2 samples (columns)

### Assume - 

**Null Hypothesis (Ho) as no Variance: All samples TAT population means are same.**

**Alternate Hypothesis (Ha) as it has Variance: Atleast one sample TAT population mean is different.**

In [7]:
p_value = stats.f_oneway(labtat_data.iloc[:,0],labtat_data.iloc[:,1],labtat_data.iloc[:,2],labtat_data.iloc[:,3])
p_value           # Anova f-test: stats.f_oneway(column-1,column-2,column-3,column-4)

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [6]:
p_value[1]

2.1156708949992414e-57

### Comparing p-value with alpha(0.05)

### Inference

##### Since p_value 2.11e-57 < 0.05

##### Null hypothesis is rejected

##### Therefore, we can conclude that there is difference in average TAT (Turn Around Time) among different laboratories.

**------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------**